app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('Luke Skywalker', 'luke@starwars.com', '$2a$10$3xoyOJHUqLH0.dPJohiQs.M6zS57dEZb21g4gSnBUT8oSnKn5ONiO', '2018-09-22 03:06:31', '2018-09-22 03:06:31')
---
  def create
    @user = User.new(user_params)

    if @user.save